# Data frame
    # introduction
    
     - 2d labelled array having index and columns
     - multiple series combined together to form a data frame
     - most widely used data structure in pandas

In [10]:
import numpy as np
import pandas as pd

In [11]:
arr=np.random.randint(10,100,size=(6,4))

In [12]:
arr

array([[74, 59, 21, 16],
       [65, 21, 62, 59],
       [21, 54, 49, 14],
       [21, 33, 70, 48],
       [88, 25, 52, 10],
       [49, 50, 43, 97]])

In [14]:
df=pd.DataFrame(data=arr)
df

    0   1   2   3
0  74  59  21  16
1  65  21  62  59
2  21  54  49  14
3  21  33  70  48
4  88  25  52  10
5  49  50  43  97

In [15]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[2]

0    21
1    62
2    49
3    70
4    52
5    43
Name: 2, dtype: int32

In [18]:
type(df[2])

pandas.core.series.Series

In [ ]:
#data frame is a collection of multiple series

In [19]:
#how to change the column name
#df=pd.dataframe(data=arr,column=[list of column names you want])

In [22]:
df.columns=['A','B','C','D'] #giving names to column
df

    A   B   C   D
0  74  59  21  16
1  65  21  62  59
2  21  54  49  14
3  21  33  70  48
4  88  25  52  10
5  49  50  43  97

In [24]:
df.shape # no of rows and columns

(6, 4)

In [25]:
df.head() #gives first 5 rows

#df.head(no of rows you want)

    A   B   C   D
0  74  59  21  16
1  65  21  62  59
2  21  54  49  14
3  21  33  70  48
4  88  25  52  10

In [26]:
df.tail()

    A   B   C   D
1  65  21  62  59
2  21  54  49  14
3  21  33  70  48
4  88  25  52  10
5  49  50  43  97

In [28]:
#extracting columns
df['C']

0    21
1    62
2    49
3    70
4    52
5    43
Name: C, dtype: int32

In [32]:
cols=['A','B']
df[cols]

#simple way to create it
df[['A','B']]

    A   B
0  74  59
1  65  21
2  21  54
3  21  33
4  88  25
5  49  50

In [31]:
# single column when extracted it is series
#but when you extract two or more than two columns it again becomes data frame

In [ ]:
df[['B','D','A']] #this will give you B column first then D column then A column

In [33]:
# to add new columns
df['A+B']=df['A']+df['B'] 
#here we have creaed a column A+B which is the combination of the A and B

In [34]:
df

    A   B   C   D  A+B
0  74  59  21  16  133
1  65  21  62  59   86
2  21  54  49  14   75
3  21  33  70  48   54
4  88  25  52  10  113
5  49  50  43  97   99

In [37]:
df.drop(columns=['A']) #to delete a Column

    B   C   D  A+B
0  59  21  16  133
1  21  62  59   86
2  54  49  14   75
3  33  70  48   54
4  25  52  10  113
5  50  43  97   99